print('Шляпка гриба, покрытая … кожиц..й, держится на … ножк.. . Снизу шляпка затянута … плёнкой. Когда её уберёшь, откроется нижняя … сторона шляпк.. .')

a = input("Введи пропущенное слово: ")
b = input("Введи пропущенную букву: ")
c = input("Введи пропущенное слово: ")
d = input('Введи пропущенную букву: ')
e = input('Введи пропущенное слово: ')
f = input("Введи пропущенную букву: ")
g = input("Введи пропущенную букву: ")

print(f'Шляпка гриба, покрытая {a} кожиц{b}й, держится на {c} ножк{d}. Снизу шляпка затянута {e} плёнкой. Когда её уберёшь, откроется нижняя {f} сторона шляпк{g}.')
